package hw;

public class HW1 {
    public static void main(String[] args) {
        // 什么叫做多态，条件是什么？
        // 多态是面向对象的三大特性之一，即对象具有多种形态，条件是得先满足继承关系
        // 父类的引用指向了子类对象

        // 使用多态特性，带来了什么样的好处？
        // 带来的好处有:
        // 1.右边的对象可以实现解耦和
        // 2.可以使用父类的参数来接收所有的子类对象

        // 使用多态特性，注意什么样的弊端？
        // 不能调用子类的特有方法

        // 关于多态的弊端我们如何解决？
        // 将父类类型转化为子类类型,强制类型转换,但要注意类型得一致

        // 在A包中我要同时使用B包下的Student和C包下的Student类，该如何使用？
        // 使用全类名即可 B.Student 和 C.Student

        // final修饰类，修饰方法，修饰变量的特点？
        // final修饰的类是最终类,不能被继承
        // final修饰的方法,子类不能重写该方法
        // final修饰的变量是常量,只能赋值一次,不能再被修改
    }
}
